OpenFOAM-v2112/tutorials/combustion/reactingFoam/RAS/chokedNozzle/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0.00  0.25  0)    //  0
    (1.00  0.25  0)    //  1
    (1.25  0.00  -0.6) //  2
    (2.25  0.00  -0.6) //  3
    (2.50  0.25  0)    //  4
    (4.00  0.35  0.2)  //  5

    (4.00  0.45  0.2)  //  6
    (2.50  0.75  0)    //  7
    (2.25  1.00  -0.6) //  8
    (1.25  1.00  -0.6) //  9
    (1.00  0.75  0)    // 10
    (0.00  0.75  0)    // 11


    (0.00  0.25  0.6)  // 12
    (1.00  0.25  0.6)  // 13
    (1.25  0.00  1.2)  // 14
    (2.25  0.00  1.2)  // 15
    (2.50  0.25  0.6)  // 16
    (4.00  0.35  0.4)  // 17

    (4.00  0.45  0.4)  // 18
    (2.50  0.75  0.6)  // 19
    (2.25  1.00  1.2)  // 20
    (1.25  1.00  1.2)  // 21
    (1.00  0.75  0.6)  // 22
    (0.00  0.75  0.6)  // 23
);

blocks
(
    hex ( 0  1 10 11 12 13 22 23) (20 20 10) simpleGrading (1 1 1)
    hex ( 1  2  9 10 13 14 21 22) ( 8 20 10) simpleGrading (1 1 1)
    hex ( 2  3  8  9 14 15 20 21) (20 20 10) simpleGrading (1 1 1)
    hex ( 3  5  6  8 15 17 18 20) (30 20 10) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    walls
    {
        type wall;
        faces
        (
            ( 0  1 13 12)
            ( 1  2 14 13)
            ( 2  3 15 14)
            ( 3  5 17 15)
            ( 6  8 20 18)
            ( 8  9 21 20)
            ( 9 10 22 21)
            (10 11 23 22)
            ( 0 11 10  1)
            ( 1 10  9  2)
            ( 2  9  8  3)
            ( 3  8  6  5)
            (12 13 22 23)
            (13 14 21 22)
            (14 15 20 21)
            (15 17 18 20)
        );
    }

    inletair
    {
        type patch;
        faces
        (
            (11  0 12 23)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            ( 5  6 18 17)
        );
    }
);


// ************************************************************************* //
